CSI API ETABS v1

# cSapModelPointElm Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPointElm PointElm { get; }

    ReadOnly Property PointElm As cPointElm
    	Get

    Dim instance As cSapModel
    Dim value As cPointElm

    value = instance.PointElm

    property cPointElm^ PointElm {
    	cPointElm^ get ();
    }

    abstract PointElm : cPointElm with get

#### Property Value

Type: cPointElm

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com